================================================================================
assignment simple
================================================================================
$foo = 123
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (number)))

================================================================================
assignment function
================================================================================
$foo = match(123)
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (function_call
      (name)
      (argument_list
        (argument
          (number))))))

================================================================================
assignment float
================================================================================
$foo = 123.45
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (number)))

================================================================================
assignment scientific number
================================================================================
$foo = 42e6
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (number)))

================================================================================
assignment local variable
================================================================================
$_foo = 123
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (number)))

================================================================================
assignment reference
================================================================================
$foo = Test['asdf']
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (type)
    (access
      (access_element
        (single_quoted_string)))))

================================================================================
assignment absolute scope
================================================================================
$::foo = 123
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (number)))
