================================================================================
data structures hash
================================================================================
$hash = { 1 => 'asdf', 2 => 'foo', 'b' => 123 }
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (operator)
    (hash
      (hashpair
        (number)
        (arrow)
        (string))
      (hashpair
        (number)
        (arrow)
        (string))
      (hashpair
        (string)
        (arrow)
        (number)))))

================================================================================
data structures array
================================================================================
['base::linux', 'apache']
--------------------------------------------------------------------------------
(manifest
  (statement
    (array
      (array_element
        (string))
      (array_element
        (string)))))

================================================================================
data structures hash of array
================================================================================
$hash_of_arrays = {
  1      => [1, 2, 3, 4 ],
  'asdf' => { 'a' =>1 },
}
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (operator)
    (hash
      (hashpair
        (number)
        (arrow)
        (array
          (array_element
            (number))
          (array_element
            (number))
          (array_element
            (number))
          (array_element
            (number))))
      (hashpair
        (string)
        (arrow)
        (hash
          (hashpair
            (string)
            (arrow)
            (number)))))))

================================================================================
data structures mixed structure
================================================================================
$struct = [
        { 1 => [
                'a',
                'b',
                'c'
               ]
        },
        {
                'asdf' => {
                        'foo' => 'bar'
                }
        },
]
--------------------------------------------------------------------------------
(manifest
  (statement
    (variable
      (name))
    (operator)
    (array
      (array_element
        (hash
          (hashpair
            (number)
            (arrow)
            (array
              (array_element
                (string))
              (array_element
                (string))
              (array_element
                (string))))))
      (array_element
        (hash
          (hashpair
            (string)
            (arrow)
            (hash
              (hashpair
                (string)
                (arrow)
                (string)))))))))

================================================================================
data structures empty array
================================================================================
[]
--------------------------------------------------------------------------------
(manifest
  (statement
    (array)))
