================================================================================
expression boolean or
================================================================================
true or false
--------------------------------------------------------------------------------
(manifest
  (statement
    (binary
      (true)
      (false))))

================================================================================
expression boolean equals
================================================================================
'foo' == 'bar'
--------------------------------------------------------------------------------
(manifest
  (statement
   (binary
     (string)
     (string))))

================================================================================
expression boolean match
================================================================================
'foobar' =~ /foo/
--------------------------------------------------------------------------------
(manifest
  (statement
    (binary
      (string)
      (regex))))

================================================================================
expression boolean in
================================================================================
'Solaris' in ['Linux', 'Solaris']
--------------------------------------------------------------------------------
(manifest
  (statement
    (binary
      (string)
    (array
      (array_element
        (string))
      (array_element
        (string))))))

================================================================================
expression boolean numeric
================================================================================
90 < 7
--------------------------------------------------------------------------------
(manifest
  (statement
    (binary
      (number)
      (number))))

================================================================================
expression boolean unary
================================================================================
!true
--------------------------------------------------------------------------------
(manifest
  (statement
    (unary
      (true))))

================================================================================
boolean expressions
================================================================================
1 in [1,2,3]

$x = true and false

$y = ((true and 1) and false)
--------------------------------------------------------------------------------
(manifest
  (statement
    (binary
      (number)
      (array
        (array_element
          (number))
        (array_element
          (number))
        (array_element
          (number)))))
  (statement
    (variable
      (name))
    (binary
      (true)
      (false)))
  (statement
    (variable
      (name))
    (binary
      (binary
        (true)
        (number))
      (false))))

================================================================================
boolean parsed as function name
:error
================================================================================
true and false
((true and 1) and false)
--------------------------------------------------------------------------------
