================================================================================
function definition
================================================================================
function foo::bar(String $foo) >> Boolean {

}
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_definition
      (classname
        (name))
    (parameter_list
      (parameter
        (typed_parameter
          (type)
          (regular_parameter
            (variable
              (name))))))
    (return_type
      (type))
    (block))))

================================================================================
function call
================================================================================
stdlib::ensure($ensure, 'file')
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_call
      (name)
      (argument_list
        (argument
          (variable
            (name)))
        (argument
          (single_quoted_string))))))

================================================================================
function call with trailing comma in argument list
================================================================================
stdlib::ensure($ensure,)
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_call
      (name)
      (argument_list
        (argument
          (variable
            (name)))))))

================================================================================
function call with single hash element
================================================================================
run_task('_catch_errors' => true)
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_call
      (name)
    (argument_list
      (argument
        (hashpair
          (single_quoted_string)
          (arrow)
          (true)))))))

================================================================================
function call method
================================================================================
$foo.join('_')
--------------------------------------------------------------------------------
(manifest
  (statement
    (call_method_with_lambda
      (call_method
        (named_access
          (variable
            (name))
          (name))
        (argument_list
          (argument
            (single_quoted_string)))))))

================================================================================
function call with lambda
================================================================================
each($binaries) |$binary| { }
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_call
      (name)
      (argument_list
        (argument
          (variable
             (name))))
    (lambda
      (parameter_list
        (parameter
          (regular_parameter
            (variable
              (name)))))
      (block)))))

================================================================================
function call with interpolation
================================================================================
warning("Module foo not tested against ${operatingsystem}")
--------------------------------------------------------------------------------
(manifest
  (statement
    (statement_function
      (name)
      (argument_list
        (argument
          (double_quoted_string
            (interpolation
              (variable
                (name)))))))))

================================================================================
function call with Type
================================================================================
lookup('val', String, undef, [])
--------------------------------------------------------------------------------
(manifest
  (statement
    (function_call
      (name)
      (argument_list
        (argument
          (single_quoted_string))
        (argument
          (type))
        (argument
          (undef))
        (argument
          (array))))))

================================================================================
function call function method chain
================================================================================
lookup('classes').join('_').include
--------------------------------------------------------------------------------
(manifest
  (statement
    (call_method_with_lambda
      (call_method
        (named_access
          (call_method_with_lambda
            (call_method
              (named_access
                (function_call
                  (name)
                  (argument_list
                    (argument
                      (single_quoted_string))))
                (name))
              (argument_list
                (argument
                  (single_quoted_string)))))
          (name))))))

================================================================================
function chained with call on the next line
================================================================================
$a = [1, 2, 3]
    .map |$n| {
        $n * $n
    }
--------------------------------------------------------------------------------

(manifest
  (statement
    (variable
      (name))
    (call_method_with_lambda
      (call_method
        (named_access
          (array
            (array_element
              (number))
            (array_element
              (number))
            (array_element
              (number)))
          (name)))
      (lambda
        (parameter_list
          (parameter
            (regular_parameter
              (variable
                (name)))))
        (block
          (statement
            (binary
              (variable
                (name))
              (variable
                (name)))))))))
